Repository: open-contracting/extension-explorer
Catalog: extension_explorer/locale/*/LC_MESSAGES/messages.po
Languages: es

source: <a href='#documentation'>Documentation (required)</a>
es: <a href='#documentation'>Documentación (obligatoria)</a>

source: <a href='#schema'>Schema (optional)</a>
es: <a href='#schema'>Esquema (opcional)</a>

source: <a href='#codelists'>Codelists (optional)</a>
es: <a href='#codelists'>Listas de códigos (opcional)</a>

source: To see the extension's structure visually, visit the <a href='https://github.com/open-contracting/standard_extension_template'>extension template</a>.
es: Para ver visualmente la estructura de la extensión, visita <a href='https://github.com/open-contracting/standard_extension_template'>la plantilla de extensión</a> .

source: Metadata (required)
es: Metadatos (requerido)

source: The extension's metadata is expressed as an <code>extension.json</code> file.
es: Los metadatos de la extensión se expresan como un archivo <code>extension.json</code>.

source: The file's contents must conform to the <a href='https://github.com/open-contracting/standard-maintenance-scripts/blob/main/schema/extension-schema.json'>extension schema</a> (<a href='https://json-schema.app/view/%%23?url=https%%3A%%2F%%2Fraw.githubusercontent.com%%2Fopen-contracting%%2Fstandard-maintenance-scripts%%2Frefs%%2Fheads%%2Fmain%%2Fschema%%2Fextension-schema.json'>schema viewer</a>).
es: El contenido del archivo debe cumplir con el <a href='https://github.com/open-contracting/standard-maintenance-scripts/blob/main/schema/extension-schema.json'>esquema de extensión</a> (<a href='https://json-schema.app/view/%%23?url=https%%3A%%2F%%2Fraw.githubusercontent.com%%2Fopen-contracting%%2Fstandard-maintenance-scripts%%2Frefs%%2Fheads%%2Fmain%%2Fschema%%2Fextension-schema.json'>visor de esquemas</a> ).

source: Guidance
es: Guía

source: Use the <a href='https://github.com/open-contracting/standard_extension_template'>extension template's</a> <a href='https://github.com/open-contracting/standard_extension_template/blob/master/extension.json'><code>extension.json</code> file</a> as a starting point.
es: Usa el archivo <a href='https://github.com/open-contracting/standard_extension_template/blob/master/extension.json'><code>extension.json</code> </a>de la <a href='https://github.com/open-contracting/standard_extension_template'>plantilla de extensión</a> como punto de partida.

source: You can edit and validate your <code>extension.json</code> file, while reading the extension schema, by using the <a href='https://json-schema.app/view/%%23?url=https%%3A%%2F%%2Fraw.githubusercontent.com%%2Fopen-contracting%%2Fstandard-maintenance-scripts%%2Frefs%%2Fheads%%2Fmain%%2Fschema%%2Fextension-schema.json'>Atlassian JSON Schema Viewer</a>.
es: Puedes editar y validar tu archivo <code>extension.json</code>, mientras lees el esquema de extensión, utilizando el <a href='https://json-schema.app/view/%%23?url=https%%3A%%2F%%2Fraw.githubusercontent.com%%2Fopen-contracting%%2Fstandard-maintenance-scripts%%2Frefs%%2Fheads%%2Fmain%%2Fschema%%2Fextension-schema.json'>Visor de esquemas JSON de Atlassian</a>.

source: To write a good description:
es: Para escribir una buena descripción:

source: Describe the changes made by the extension, at a high level.
es: Describe los cambios realizados por la extensión, en un nivel alto.

source: Although there's no maximum length, be concise. That said, do not sacrifice clarity for the sake of brevity.
es: Aunque no hay una extensión máxima, se conciso. Dicho esto, no sacrifiques la claridad en aras de la brevedad.

source: Do not simply duplicate or paraphrase the extension's name.
es: No te limites a duplicar o parafrasear el nombre de la extensión.

source: Do not include the development status of the extension (like “draft”). If needed, describe the status in the <a href='#documentation'>documentation</a>.
es: No incluyas el estado de desarrollo de la extensión (como “borrador”). Si es necesario, describa el estado en la <a href='#documentation'>documentación</a>.

source: For example, for <a href='https://github.com/open-contracting-extensions/ocds_performance_failures_extension'>Performance failures</a>, a bad description is:
es: Por ejemplo, para <a href='https://github.com/open-contracting-extensions/ocds_performance_failures_extension'>Errores de rendimiento</a>, una descripción incorrecta sería:

source: An extension covering performance failures in OCDS.
es: Una extensión que cubre fallas de rendimiento en OCDS.

source: A good description is:
es: Una buena descripción es:

source: Adds fields to the implementation section to allow disclosure of an array of contracting performance failures. Based on the performance failures reporting table defined in the World Bank Framework for Disclosure in PPPs.
es: Agrega campos a la sección de implementación para permitir la divulgación de una serie de fallas en el desempeño de la contratación. Basado en la tabla de informes de fallas en el desempeño definida en el Marco del Banco Mundial para la Divulgación de Información en las APP.

source: The <code>description</code> field is displayed on this website.
es: El campo <code>description</code> se muestra en este sitio web.

source: Documentation (required)
es: Documentación (requerida)

source: The extension's documentation is expressed as a <code>README.md</code> file.
es: La documentación de la extensión se expresa como un archivo <code>README.md</code>.

source: The <code>README.md</code> file must be in Markdown format.
es: El archivo <code>README.md</code> debe estar en formato Markdown.

source: The <code>README.md</code> file should include a description of the extension and its use cases, and examples of OCDS data that use the extension's fields and/or codes.
es: El archivo <code>README.md</code> debe incluir una descripción de la extensión y sus casos de uso, y ejemplos de datos OCDS que utilizan los campos y/o códigos de la extensión.

source: You may provide documentation in addition to the <code>README.md</code> file.
es: Puedes proporcionar documentación adicionalmente al archivo <code>README.md</code>.

source: Schema (optional)
es: Esquema (opcional)

source: The extension's new fields and changed fields are expressed as a <code>release-schema.json</code> file. This file has the same structure as OCDS' release schema.
es: Los campos nuevos y modificados de la extensión se expresan como un archivo <code>release-schema.json</code>. Este archivo tiene la misma estructura que el esquema de release de OCDS.

source: The file contains a fragment of <a href='https://json-schema.org/'>JSON Schema</a>, known as a <a href='https://tools.ietf.org/html/rfc7386'>JSON Merge Patch</a>, that can be merged into OCDS' release schema, to produce an “extended schema.”
es: El archivo contiene un fragmento del <a href='https://json-schema.org/'>esquema JSON</a> , conocido como <a href='https://tools.ietf.org/html/rfc7386'>JSON Merge Patch</a>, que se puede combinar con el esquema de release de OCDS para producir un "esquema extendido".

source: The file must describe <strong>only</strong> new fields or changed fields.
es: El archivo debe describir <strong>solamente</strong> campos nuevos o campos modificados.

source: The file's contents must conform to <a href='https://json-schema.org/specification-links#draft-4'>JSON Schema Draft 4</a>.
es: El contenido del archivo debe cumplir con el <a href='https://json-schema.org/specification-links#draft-4'>JSON Schema Draft 4</a>.

source: The file should follow the <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html'>schema style guide</a>.
es: El archivo debe seguir la <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html'>guía de estilo de esquema</a> .

source: For example, this schema adds a <code>statusDetails</code> field to the <code>Contract</code> subschema:
es: Por ejemplo, este esquema agrega un campo <code>statusDetails</code> al subesquema <code>Contract</code>:

source: If you are unfamiliar with JSON Schema, you can use <a href='https://transform.tools/json-to-json-schema'>Transform</a> to generate an <em>initial</em> schema from a sample or mockup of your OCDS data. Then, add <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html#field-and-code-titles'><code>title</code></a> and <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html#field-and-code-descriptions'><code>description</code></a> properties, and follow the <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html'>schema style guide</a>, in particular the <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html#validation-keywords'>validation keywords section</a>.
es: Si no estás familiarizado con el esquema JSON, puedes usar <a href='https://transform.tools/json-to-json-schema'>Transform</a> para generar un esquema <em>inicial</em> a partir de una muestra o maqueta de tus datos OCDS. Luego, agrega <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html#field-and-code-titles'><code>title</code></a> y <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html#field-and-code-descriptions'><code>description</code></a> y sigue la <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html'>guía de estilo de esquema</a>, en particular la <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html#validation-keywords'>sección de palabras clave de validación</a>.

source: Codelists (optional)
es: Listas de códigos (opcional)

source: The extension's new codelists and new codes are expressed as CSV files in a <code>codelists</code> directory. These files have the same structure as OCDS' codelists.
es: Las nuevas listas de códigos y los nuevos códigos de la extensión se expresan como archivos CSV en un directorio <code>codelists</code>. Estos archivos tienen la misma estructura que las listas de códigos de OCDS.

source: A codelist file must describe <strong>only</strong> new codelists or new codes.
es: Un archivo de lista de códigos debe describir <strong>solamente</strong> nuevas listas de códigos o nuevos códigos.

source: A codelist file's name must be camel case, like <code>tenderStatus.csv</code>.
es: El nombre de un archivo de lista de códigos debe estar en mayúsculas y minúsculas, como <code>tenderStatus.csv</code>.

source: A codelist file's contents must conform to the <a href='https://github.com/open-contracting/standard-maintenance-scripts/blob/main/schema/codelist-schema.json'>codelist schema</a> (in the <a href='https://json-schema.app/view/%%23?url=https%%3A%%2F%%2Fraw.githubusercontent.com%%2Fopen-contracting%%2Fstandard-maintenance-scripts%%2Frefs%%2Fheads%%2Fmain%%2Fschema%%2Fcodelist-schema.json'>schema viewer</a>, expand the <em>Root definitions</em> accordion and click the <em>Row</em> item).
es: El contenido de un archivo de lista de códigos debe cumplir con el <a href='https://github.com/open-contracting/standard-maintenance-scripts/blob/main/schema/codelist-schema.json'>esquema de lista de códigos</a> (en el <a href='https://json-schema.app/view/%%23?url=https%%3A%%2F%%2Fraw.githubusercontent.com%%2Fopen-contracting%%2Fstandard-maintenance-scripts%%2Frefs%%2Fheads%%2Fmain%%2Fschema%%2Fcodelist-schema.json'>visor de esquemas</a> , expande el acordeón <em>Definiciones raíz</em> y haz clic en el ítem </em>Fila</em> ).

source: A codelist file should follow the style guides for <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html#field-and-code-names'>code names</a>, <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html#field-and-code-titles'>code titles</a> and <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html#field-and-code-descriptions'>code descriptions</a>.
es: Un archivo de lista de códigos debe seguir las guías de estilo para <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html#field-and-code-names'>nombres de código</a>, <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html#field-and-code-titles'>títulos de código</a> y <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html#field-and-code-descriptions'>descripciones de código</a>.

source: To add a new codelist, make sure that its filename is not the same as an <a href='https://standard.open-contracting.org/schema/1__1__5/codelists/'>existing codelist's filename</a>. Add and fill in the <code>Code</code>, <code>Title</code>, and <code>Description columns</code>.
es: Para agregar una nueva lista de códigos, asegúrate de que su nombre de archivo no sea el mismo que el nombre de archivo de una <a href='https://standard.open-contracting.org/schema/1__1__5/codelists/'>lista de códigos existente</a>. Agrega y completa las columnas <code>Code</code>, <code>Title</code> y <code>Description</code>.

source: To add new codes to an <strong>open</strong> codelist, create a file that prefixes a plus sign (<code>+</code>) to the codelist's filename, and make sure that the new codes do not match any existing codes. Use the same columns as the original codelist.
es: Para agregar nuevos códigos a una lista de códigos <strong>abierta</strong>, crea un archivo que anteponga un signo más (<code>+</code>) al nombre de archivo de la lista de códigos y asegúrate de que los nuevos códigos no coincidan con ningún código existente. Utiliza las mismas columnas que la lista de códigos original.

source: For example, to add a 'subcontractor' code to the <code>partyRole.csv</code> codelist, create a <code>+partyRole.csv</code> file in your extension's <code>codelists</code> directory, and set its content to:
es: Por ejemplo, para agregar un código de 'subcontractor' a la lista de códigos <code>partyRole.csv</code>, crea un archivo <code>+partyRole.csv</code> en el directorio <code>codelists</code> de tu extensión y establece su contenido como:

source: Repository name
es: Nombre del repositorio

source: Names of repositories should follow the pattern: <code>ocds_{name}_extension</code>. For example: <code>ocds_bidOpening_extension</code>
es: Los nombres de los repositorios deben seguir el patrón: <code>ocds_{name}_extension</code>. Por ejemplo: <code>ocds_bidOpening_extension</code>

source: The name should indicate the domain (like <a href='%(medicine_url)s'>medicine</a>) or the field being added (like <a href='%(covered_by_url)s'>coveredBy</a>). If the field being added is ambiguous, the parent object should prefix the field name (like <a href='%(document_publisher_url)s'>document_publisher</a>).
es: El nombre debe indicar el dominio (como <a href='%(medicine_url)s'>medicine</a>) o el campo que se va a agregar (como <a href='%(covered_by_url)s'>coveredBy</a>). Si el campo que se va a agregar es ambiguo, el objeto padre debe anteponer el nombre del campo (como <a href='%(document_publisher_url)s'>document_publisher</a>).

source: This page has moved to a <a href="%(redirect)s">%(redirect)s</a>
es: Esta página se ha movido a <a href="%(redirect)s">%(redirect)s</a>

source: User Guidance
es: Guía de usuarios

source: To use data, you first need to understand its structure and meaning. OCDS data can contain fields from:
es: Para utilizar los datos, primero debe entender la estructura y el significado. Los datos OCDS pueden contener campos de:

source: OCDS, whose fields are described in its schema and in its <a href="https://standard.open-contracting.org/latest/%(lang)s/schema/">Schema Reference</a>.
es: OCDS, los campos se describen en su esquema y en la <a href="https://standard.open-contracting.org/latest/%(lang)s/schema/">referencia del esquema</a>.

source: Extensions, whose fields are described in their schema and in their documentation.
es: Extensiones, los campos se describen en su esquema y en su documentación.

source: To identify which extensions are used in OCDS data, you can either:
es: Para identificar que extensiones se utilizan en los datos OCDS, puede:

source: Check for an <code>extensions</code> field at the package level. For data with extensions, this field contains an array of URLs to <code>extension.json</code> files. Each file contains a <code>documentationUrl</code> object with a URL to the extension's documentation. Open the URL to read its documentation (in many cases, the URL leads to this website). For example, the following data declares the Bid statistics and details extension:
es: Revisar un campo de <code>extensiones</code>a nivel paquete. Para datos con extensiones, este campo contiene una lista de URLs con archivos <code>extension.json</code>. Cada campo contiene un objeto <code>documentationUrl</code> con una URL a la documentación de la extensión. Abra la URL para leer la documentación (en muchos casos, la URL lleva a este sitio web). Por ejemplo, los siguientes datos declaran la extensión estadísticas y detalles de Oferta:

source: Upload the data to the <a href="https://review.standard.open-contracting.org/">OCDS Data Review Tool</a>, which lists the extensions used and links to their documentation.
es: Sube tus datos a la <a href="https://review.standard.open-contracting.org/">OCDS Data Review Tool</a>, la cual lista las extesniones utilizadas y los enlances a su documentación.
