Repository: open-contracting/extension-explorer
Catalog: extension_explorer/locale/*/LC_MESSAGES/messages.po
Languages: es

source: latest
es: más reciente

source: Changelog
es: Registro de cambios

source: Description
es: Descripción

source: or
es: o

source: object
es: objetos

source: string from open <a href="%(url)s">%(codelist)s</a> codelist
es: cadena de la lista de código <a href="%(url)s">%(codelist)s</a> abierta

source: string from closed <a href="%(url)s">%(codelist)s</a> codelist
es: cadena de la lista de código <a href="%(url)s">%(codelist)s</a> cerrada

source: string from <a href="%(url)s">%(codelist)s</a> codelist
es: cadena de la lista de código <a href="%(url)s">%(codelist)s</a>

source: array of %(subtypes)s
es: matriz de %(subtypes)s

source: OCDS Extension Explorer
es: Explorador de Extensiones OCDS

source: %(name)s — OCDS Extension Explorer
es: %(name)s- Explorador de Extensiones OCDS

source: Public Private Partnerships
es: Asociaciones Público Privadas

source: European Union
es: Unión Europea

source: Agreement on Government Procurement
es: Acuerdo sobre Contratación Pública

source: Fiscal extensions
es: Extensiones fiscales

source: %(name)s — Codelists — OCDS Extension Explorer
es: %(name)s — Listas de código — Explorador de Extensiones OCDS

source: Documentation of the codes in the %(name)s extension
es: Documentación de los códigos en la extensión %(name)s

source: Codelists
es: Listas de código

source: You can <a href="%(url)s">download the <code>%(codelist)s</code> file</a> in English.
es: Puede <a href="%(url)s">descargar el archivo <code>%(codelist)s</code></a> en inglés.

source: The extension adds these codes to the <a href="%(url)s"><code>%(codelist)s</code> codelist</a>.
es: La extensión añade estos códigos a la <a href="%(url)s"><code>%(codelist)s</code> lista de código</a>.

source: The extension removes these codes from the <a href="%(url)s"><code>%(codelist)s</code> codelist</a>.
es: La extensión quita los códigos de la <a href="%(url)s"><code>%(codelist)s</code> lista de código</a>.

source: The extension replaces the <a href="%(url)s"><code>%(codelist)s</code> codelist</a> with these codes.
es: La extensión reemplaza la <a href="%(url)s"><code>%(codelist)s</code> lista de código </a> con estos códigos.

source: %(name)s — Documentation — OCDS Extension Explorer
es: %(name)s — Documentación — Explorador de Extensiones OCDS

source: Documentation
es: Documentación

source: %(name)s — Schema — OCDS Extension Explorer
es: %(name)s — Esquema — Explorador de Extensiones OCDS

source: Documentation of the fields in the %(name)s extension
es: Documentación de los campos en la extensión %(name)s

source: Schema
es: Esquema

source: Removed fields
es: Quitar campos

source: You can <a href="%(url)s">download the <code>release-schema.json</code> file</a> in English.
es: Puede <a href="%(url)s">descargar el archivo<code>release-schema.json</code></a>en inglés.

source: The extension defines these fields in the release schema:
es: La extensión define estos campos en el esquema de entrega:

source: The extension defines these fields in the <a href="%(url)s"><code>%(name)s</code></a> object from OCDS:
es: La extensión define estos campos en el <a href="%(url)s"><code>%(name)s</code></a> objeto del OCDS:

source: The extension defines these fields in the <a href="%(url)s"><code>%(name)s</code></a> object from the <a href="%(extension_url)s">%(extension_name)s</a> extension:
es: La extensión define estos campos en el <a href="%(url)s"><code>%(name)s</code></a> objeto de la <a href="%(extension_url)s">%(extension_name)s</a> extensión:

source: The extension defines a new <code>%(name)s</code> object with these fields:
es: La extensión define un nuevo <code>%(name)s</code> objeto con estos campos:

source: Field
es: Campo

source: Title
es: Título

source: Type(s)
es: Tipo(s)

source: This field is modified from its <a href="%(url)s">original version</a>.
es: Este campo se modifica de su <a href="%(url)s">versión original </a>.

source: This field has <a href="https://standard.open-contracting.org/latest/{{ lang }}/schema/reference/#language">multilingual support</a>.
es: Este archivo tiene <a href="https://standard.open-contracting.org/latest/{{ lang }}/schema/reference/#language">apoyo multilingüe</a>.

source: Deprecated in OCDS %(deprecatedVersion)s:
es: Obsoleto en OCDS %(deprecatedVersion)s:

source: The extension undoes the deprecation of this field.
es: La extensión deshace la desaprobación de este campo.

source: The extension removes these fields from the release schema:
es: Esta extensión quita estos campos del esquema de entrega:

source: The extension removes these <em>deprecated</em> fields from the release schema:
es: La extensión quita los campos <em>obsoletos</em> del esquema de entrega:

source: Extensions — OCDS Extension Explorer
es: Extensiones — Explorador de Extensiones OCDS

source: Extensions
es: Extensiones

source: Show
es: Mostrar

source: Extension
es: Extensión

source: any
es: cualquier

source: recommended
es: recomendado

source: extensions
es: extensiones

source: by
es: por

source: Maintainer
es: Responsable

source: any maintainer
es: cualquier mantenedor

source: in
es: en

source: Profile
es: Perfil

source: any profile
es: cualquier perfil

source: about
es: sobre

source: Topic
es: Tema

source: any topic
es: cualquier tema

source: Showing <span id="filter-count">%(num)d</span> extensions from the <a href="https://github.com/open-contracting/extension_registry">extension registry</a>
es: Mostrando <span id="filter-count">%(num)d</span> extensiones del <a href="https://github.com/open-contracting/extension_registry">registro de extensiones</a>

source: Recommended
es: Recomendado

source: Maintained by <a href="%(url)s">%(name)s</a>
es: Mantenido por <a href="%(url)s">%(name)s</a>

source: Disclose more data about your contracting processes, using extensions to the <a href="https://standard.open-contracting.org/latest/%(lang)s/">Open Contracting Data Standard</a>.
es: Divulge más datos sobre su proceso de contrataciones, utilizando las extensiones del <a href="https://standard.open-contracting.org/latest/%(lang)s/">Estándar de Datos de Contrataciones Abiertas </a>.

source: Browse extensions
es: Ver extensiones

source: For data publishers
es: Para publicadores de datos

source: OCDS defines a core set of fields and codes for describing contracting processes. You can use extensions to describe additional fields outside the core set.
es: El OCDS define una serie de campos y códigos centrales para describir procesos de contrataciones. Puede utilizar extensiones para describir campos fuera del set central.

source: Read the publisher guidance
es: Lea la guía de publicación

source: For data users
es: Para usuarios de datos

source: OCDS data can include fields and codes from the OCDS schema and from extensions. To understand extended data, you need to identify which extensions are used and read the extensions' documentation.
es: Los datos OCDS pueden incluir campos y códigos del esquema OCDS y de las extensiones. Para entender los datos extendidos, necesita identificar las extensiones que se usaron y leer la documentación de las extensiones.

source: Read the user guidance
es: Lea la guía de usuarios

source: Toggle navigation
es: Cambiar navegación

source: Home
es: Página principal

source: Publisher guidance
es: Guía de publicadores

source: User guidance
es: Guía de usuarios

source: Select language
es: Elegir idioma

source: Version:
es: Versión:

source: Present versions
es: Versiones actuales

source: Historical versions
es: Versiones históricas

source: Toggle extension navigation
es: Cambiar la navegación de extensión

source: To use this extension, add this URL to your package's <code>extensions</code> array:
es: Para usar esta extensión, añada el URL a su matriz de paquete de <code>extensiones</code>:

source: Extension URL
es: URL de la extensión

source: Copy to clipboard
es: Copiar al portapapeles

source: Download ZIP
es: Descargar ZIP

source: Copied!
es: Copiado!

source: Publisher Guidance
es: Guía de Publicadores

source: This page is for publishers of OCDS data. It provides:
es: Esta página es para los publicadores de datos OCDS. Proporciona:

source: An introduction to extensions and the needs they satisfy
es: Una introducción a las extensiones y las necesidades que satisfacen

source: How-to guides for using and creating extensions
es: Guías prácticas para usar y crear extensiones

source: Reference documentation for extension creators
es: Documentación de referencia para creadores de extensiones

source: Introduction
es: Introducción

source: To implement OCDS, you need to <a href='https://standard.open-contracting.org/latest/en/guidance/map/'>identify the fields and codes in OCDS</a> that match the data elements in your data sources. Some data elements might not match any field or code in OCDS. To cover such cases, you can add fields and codes to OCDS using “extensions.”
es: Para implementar OCDS, debes <a href='https://standard.open-contracting.org/latest/en/guidance/map/'>identificar los campos y códigos en OCDS</a> que coinciden con los elementos de datos en tus fuentes de datos. Es posible que algunos elementos de datos no coincidan con ningún campo o código en OCDS. Para cubrir estos casos, puedes agregar campos y códigos a OCDS mediante "extensiones".

source: Extensions serve to document the meaning and structure of additional fields and codes. The benefits are:
es: Las extensiones sirven para documentar el significado y la estructura de campos y códigos adicionales. Los beneficios son:

source: By reusing extensions, your data is consistent with other publishers' data, making it possible for you and others to reuse OCDS tools and methodologies.
es: Al reutilizar extensiones, tus datos son consistentes con los datos de otros publicadores, lo que hace posible que tu y otros reutilicen las herramientas y metodologías de OCDS.

source: Analysts can access the definitions of your additional fields and codes, to help interpret your data.
es: Los analistas pueden acceder a las definiciones de tus campos y códigos adicionales para ayudarlos a interpretar tus datos.

source: Developers can read the structure of your additional fields and codes, to help write software for processing it.
es: Los desarrolladores pueden leer la estructura de tus campos y códigos adicionales para ayudar a escribir software para procesarlos.

source: How to use an extension
es: Cómo utilizar una extensión

source: <a href='%(url)s'>Find an extension</a> that describes the data element(s) you want to publish. If you can't find a suitable extension, you might need to <a href='#how-to-create-an-extension'>create an extension</a>.
es: <a href='%(url)s'>Busca una extensión</a> que describa los elementos de datos que deseas publicar. Si no puedes encontrar una extensión adecuada, es posible que debas <a href='#how-to-create-an-extension'>crear una extensión</a>.

source: Structure your data according to the extension's schema and documentation.
es: Estructura tus datos de acuerdo con el esquema y la documentación de la extensión.

source: Declare the extension in your <a href='https://standard.open-contracting.org/latest/en/schema/release_package/'>package's</a> <code>extensions</code> array, using the URL from the extension's documentation. For example, to declare the <a href='%(url)s'>Bids and expressions of interest</a> extension:
es: Declara la extensión en la lista de <code>extensions</code> del paquete <a href='https://standard.open-contracting.org/latest/en/schema/release_package/'>, utilizando la URL de la documentación de la extensión. Por ejemplo, para declarar la extensión </a>Ofertas y expresiones de interés<a href='%(url)s'>:

source: Check your data using the <a href='https://review.standard.open-contracting.org/'>OCDS Data Review Tool</a>.
es: Verifica tus datos utilizando la <a href='https://review.standard.open-contracting.org/'>herramienta de revisión de datos OCDS</a>.

source: How to create an extension
es: Cómo crear una extensión

source: If you can't find a suitable extension to describe the data elements you want to publish, you can create an extension.
es: Si no puedes encontrar una extensión adecuada para describir los elementos de datos que deseas publicar, puedes crear una extensión.

source: Extensions can add new fields, add codes to <strong>open</strong> codelists, or add validation rules to existing fields. However, extensions cannot remove fields, change the titles or descriptions of fields, or add codes to <strong>closed</strong> codelists. To suggest such changes, <a href='https://github.com/open-contracting/standard/issues/new'>open an issue</a> on the standard issue tracker.
es: Las extensiones pueden agregar nuevos campos, agregar códigos a listas de códigos <strong>abiertas</strong> o agregar reglas de validación a campos existentes. Sin embargo, las extensiones no pueden eliminar campos, cambiar los títulos o descripciones de los campos ni agregar códigos a listas de códigos <strong>cerradas</strong>. Para sugerir dichos cambios, <a href='https://github.com/open-contracting/standard/issues/new'>abre un issue en el tracker de issues del estándar.

source: Consider whether the data you want to publish belongs to the contracting process or whether it exists independently. Data that exists independently of the contracting process is typically better published in a separate dataset. For example, data on the <a href='https://standard.open-contracting.org/latest/en/guidance/map/beneficial_ownership/'>beneficial owners</a> of suppliers is usually tracked outside of procurement systems.
es: Considera si los datos que deseas publicar pertenecen al proceso de contratación o si existen de forma independiente. Los datos que existen de forma independiente del proceso de contratación suelen publicarse mejor en un conjunto de datos separado. Por ejemplo, los datos sobre los <a href='https://standard.open-contracting.org/latest/en/guidance/map/beneficial_ownership/'>beneficiarios finales</a> de los proveedores suelen recolectarse fuera de los sistemas de contratación.

source: To create an extension that adds a new field or validation rule, you need to understand <a href='http://json-schema.org/'>JSON Schema</a> and the structure of the <a href='https://standard.open-contracting.org/latest/en/schema/'>OCDS schema</a>.
es: Para crear una extensión que agregue un nuevo campo o regla de validación, debes comprender<a href='http://json-schema.org/'> el esquema JSON</a> y la estructura del <a href='https://standard.open-contracting.org/latest/en/schema/'>esquema OCDS</a> .

source: There are six steps to creating an extension:
es: Hay seis pasos para crear una extensión:

source: 1. Discuss
es: 1. Discutir

source: Before creating an extension, search for related discussions on the <a href='https://github.com/open-contracting/standard/issues'>standard issue tracker</a>.
es: Antes de crear una extensión, busca discusiones relacionadas en el issue tracker del estándar</a>.

source: If you can't find any related discussions, <a href='https://github.com/open-contracting/standard/issues/new'>open a GitHub issue</a> to describe the extension you plan to create. Include in the issue's description:
es: Si no encuentras ninguna discusión relacionada, <a href='https://github.com/open-contracting/standard/issues/new'>abre un issue en GitHub</a> para describir la extensión que planeas crear. Incluye en la descripción del issue:

source: The extension's use case(s). Describe your reason for adding fields and/or codes and what users will do with the data.
es: Casos de uso de la extensión. Describe el motivo por el que agregas campos o códigos y qué harán los usuarios con los datos.

source: The concept or process that you want to represent. You can include legislative references or other documentation.
es: El concepto o proceso que se deseas representar. Se pueden incluir referencias legislativas u otra documentación.

source: Examples of existing data. Provide examples from your data sources of the data elements to be covered by the extension.
es: Ejemplos de datos existentes. Proporciona ejemplos de tus fuentes de datos de los elementos de datos que cubrirá la extensión.

source: To encourage collaboration, keep this issue up-to-date throughout the development of your extension.
es: Para fomentar la colaboración, mantén este issue actualizado durante todo el desarrollo de tu extensión.

source: 2. Model
es: 2. Modelado

source: Once you are clear on your concepts and use cases, you need to decide on the name, structure and format of any additional fields in your extension, and on the name of any additional codes.
es: Una vez que tengas claros tus conceptos y casos de uso, deberás decidir el nombre, la estructura y el formato de cualquier campo adicional en tu extensión, y el nombre de cualquier código adicional.

source: You can start by mocking up an example of the data for which you are creating an extension, as JSON. Consider:
es: Puedes comenzar creando un ejemplo de los datos para los que estás creando una extensión, como JSON. Considera lo siguiente:

source: How would different data fit into this structure?
es: ¿Cómo encajarían los diferentes datos en esta estructura?

source: Are the names of fields and codes intuitive to users?
es: ¿Los nombres de los campos y códigos son intuitivos para los usuarios?

source: Is the structure easy for applications to consume?
es: ¿La estructura es fácil de consumir para las aplicaciones?

source: You can also check other standards for potential models. The more you consider different examples of source data and different uses of the OCDS data, the better.
es: También puedes consultar otros estándares para encontrar modelos potenciales. Cuanto más consideres diferentes ejemplos de datos de origen y diferentes usos de los datos OCDS, mejor.

source: Before continuing, invite feedback on your mockup, using the GitHub issue you created in the previous step.
es: Antes de continuar, solicita comentarios sobre tu mockup, utilizando el issue de GitHub que creaste en el paso anterior.

source: 3. Author
es: 3. Crear

source: Once you settle on a model, you need to author (as applicable) the metadata, documentation, schema and codelists. You can use the <a href='https://github.com/open-contracting/standard_extension_template'>extension template</a>. For details, see <a href='#reference'>Reference</a>.
es: Una vez que te decidas por un modelo, deberás crear (según corresponda) los metadatos, la documentación, el esquema y las listas de códigos. Puedes utilizar la <a href='https://github.com/open-contracting/standard_extension_template'>plantilla de extensión</a> . Para obtener más información, consulta <a href='#reference'>Referencia</a>.

source: 4. Publish
es: 4. Publicar

source: You need to publish your extension online at a stable URL. Your extension's schema and codelist files need to be accessible by replacing <code>extension.json</code> in the extension's URL with a file's path: for example, <code>release-schema.json</code> or <code>codelists/codelist.csv</code>.
es: Debes publicar tu extensión en línea en una URL estable. Los archivos de esquema y lista de códigos de tu extensión deben ser accesibles reemplazando <code>extension.json</code> en la URL de la extensión con la ruta de un archivo: por ejemplo, <code>release-schema.json</code> o <code>codelists/codelist.csv</code>.

source: Creating a GitHub, GitLab or Bitbucket repository for your extension is a good option because it offers version control, issue tracking and appropriate URLs. For example:
es: Crear un repositorio en GitHub, GitLab o Bitbucket para tu extensión es una buena opción porque ofrece control de versiones, seguimiento de problemas y URL apropiadas. Por ejemplo:

source: When naming your repository, follow the pattern for <a href='#repository-name'>repository names</a>.
es: Al nombrar tu repositorio, sigue el patrón para <a href='#repository-name'>nombres de repositorio</a>.

source: 5. Test
es: 5. Probar

source: Test your extension by following steps 2-4 of <a href='#how-to-use-an-extension'>How to use an extension</a>. Check that the OCDS Data Review Tool reports no structural errors, additional fields or additional codes.
es: Prueba tu extensión siguiendo los pasos 2 a 4 de <a href='#how-to-use-an-extension'>Cómo usar una extensión</a>. Verifica que la herramienta de revisión de datos de OCDS no informe errores estructurales, campos adicionales o códigos adicionales.

source: 6. Register
es: 6. Registrar

source: We encourage you to <a href='https://github.com/open-contracting/extension_registry#how-to-register-an-extension'>register your extension</a>, so that others can discover it on this website.
es: Te animamos a que <a href='https://github.com/open-contracting/extension_registry#how-to-register-an-extension'>registres tu extensión</a>, para que otros puedan descubrirla en este sitio web.

source: Extensions that are relevant to only a single publisher do not need to be registered.
es: No es necesario registrar las extensiones que son relevantes para un solo publicador.

source: A registered extension needs to meet the following criteria:
es: Una extensión registrada debe cumplir los siguientes criterios:

source: The documentation is in English. According to the<a href='https://standard.open-contracting.org/latest/en/governance/#translation-and-localization-policy'> translation and localization policy</a>, “the authoritative language for the standard is English.”
es: La documentación está en inglés. Según la <a href='https://standard.open-contracting.org/latest/en/governance/#translation-and-localization-policy'>política de traducción y localización</a>, “el idioma oficial para el estándar es el inglés”.

source: The documentation, excluding examples, is more than 200 characters long. Documentation of less than 200 characters cannot adequately describe an extension, its purpose and technical details.
es: La documentación, sin incluir los ejemplos, tiene más de 200 caracteres. Una documentación de menos de 200 caracteres no puede describir adecuadamente una extensión, su propósito y sus detalles técnicos.

source: The <code>extension.json</code> and <code>README.md</code> files are not publisher-specific. If the extension's name or description suggests it is relevant to only a single publisher, then it is unlikely to be used by other publishers, even if its fields and codes are relevant.
es: Los archivos <code>extension.json</code> y <code>README.md</code> no son específicos de un publicador. Si el nombre o la descripción de la extensión sugieren que es relevante solo para un único publicador, es poco probable que la utilicen otros publicadores, incluso si sus campos y códigos son relevantes.

source: No other extension expresses the same concepts. Having multiple ways to express the same concept would be counter-productive to standardization.
es: Ninguna otra extensión expresa los mismos conceptos. Tener múltiples formas de expresar el mismo concepto sería contraproducente para la estandarización.

source: The extension follows the <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html'>schema style guide</a>.
es: La extensión sigue la <a href='https://ocds-standard-development-handbook.readthedocs.io/en/latest/meta/schema_style_guide.html'>guía de estilo de esquema</a>.

source: Reference
es: Referencia

source: This section provides reference documentation for extension creators.
es: Esta sección proporciona documentación de referencia para los creadores de extensiones.

source: Extensions consist of:
es: Las extensiones constan de:

source: <a href='#metadata'>Metadata (required)</a>
es: <a href='#metadata'>Metadatos (obligatorio)</a>
