{
  "definitions": {
    "Document": {
      "properties": {
        "pageStart": {
          "title": "Inicio de página",
          "description": "Cuando la información mencionada exista dentro de un documento grande, se debe indicar la primera página en la que se puede encontrar. Esto debe de referirse al número de página impreso, no al número de página reportado por software.",
          "type": [
            "string",
            "null"
          ],
          "minLength": 1
        },
        "pageEnd": {
          "title": "Fin de página",
          "description": "Cuando la información mencionada existe dentro de un documento grande, se debe indicar la última página en la que se puede encontrar. Esto debe de referirse al número de página impreso, no al número de página reportado por software.",
          "type": [
            "string",
            "null"
          ],
          "minLength": 1
        },
        "accessDetails": {
          "title": "Detalles de acceso",
          "description": "Una descripción de cualquier arreglo especial necesitado para acceder a estos documentos, por ejemplo: registrarse para acceder, pagar una tarifa o visitar un lugar para inspeccionar el documento.",
          "type": [
            "string",
            "null"
          ],
          "minLength": 1
        },
        "accessDetailsURL": {
          "title": "URL de detalles de acceso",
          "description": "Una dirección web para obtener información sobre cualquier disposición especial necesaria para acceder al documento.",
          "type": [
            "string",
            "null"
          ],
          "format": "uri"
        },
        "author": {
          "title": "Autor",
          "description": "Los nombres de los autores del documento.",
          "type": [
            "string",
            "null"
          ],
          "minLength": 1
        },
        "unofficialTranslations": {
          "title": "Traducciones no oficiales",
          "description": "Los idiomas en los que están disponibles las traducciones no oficiales del documento, de la lista de códigos abierta [lenguaje](https://standard.open-contracting.org/latest/en/schema/codelists/#language). Se permite una etiqueta de lenguaje [BCP47](https://www.w3.org/International/articles/language-tags/), si hay una necesidad del usuario para la información adicional.",
          "type": [
            "array",
            "null"
          ],
          "items": {
            "type": "string",
            "minLength": 1
          },
          "codelist": "language.csv",
          "openCodelist": true,
          "uniqueItems": true,
          "minItems": 1
        }
      }
    }
  }
}
